{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Liverpoolecho.co.uk"},"author":"Matt Addison","title":"Philippe Coutinho could face messy future as Liverpool posed similar coronavirus transfer uncertainty - Liverpool Echo","description":"The implications of the postponement of football due to the coronavirus outbreak are set to be wide-ranging, with many players left wondering what will happen once play resumes","url":"https://www.liverpoolecho.co.uk/sport/football/football-news/philippe-coutinho-could-face-messy-17932685","urlToImage":"https://i2-prod.liverpoolecho.co.uk/incoming/article13702274.ece/ALTERNATES/s1200/JS132497077.jpg","publishedAt":"2020-03-23T09:22:39Z","content":"With football momentarily on hold, and awaiting the green light to resume once the coronavirus outbreak has been controlled and dealt with, the sport has ground to a halt.\r\nThat means many things: the European Championships have already been postponed for 12 … [+3647 chars]"},{"source":{"id":null,"name":"Nypost.com"},"author":"Associated Press","title":"IOC considers postponing 2020 Olympics for a year after Australia, Canada drop out - New York Post ","description":"TOKYO — The Tokyo Olympics are going to happen — but almost surely in 2021 rather than in four months as planned. This became clear after the IOC on Sunday announced it was considering a postponeme…","url":"https://nypost.com/2020/03/23/ioc-considers-postponing-olympics-for-a-year-after-australia-canada-drop-out/","urlToImage":"https://thenypost.files.wordpress.com/2020/03/ap20083141969278.jpg?quality=90&strip=all&w=1200","publishedAt":"2020-03-23T06:11:32Z","content":"TOKYO The Tokyo Olympics are going to happen but almost surely in 2021 rather than in four months as planned.\r\nThis became clear after the IOC on Sunday announced it was considering a postponement. Major Olympic nations like Canada and Australia have added pr… [+4561 chars]"},{"source":{"id":null,"name":"49erswebzone.com"},"author":"David Bonilla","title":"Why free agency was good for Jimmy Garoppolo despite 49ers' offensive losses - 49ers Webzone","description":"The San Francisco 49ers didn't make any quarterback moves this past week — the start of free agency. The team lost wide receiver Emmanuel Sanders to the New Orleans Saints and parted ways with s","url":"https://www.49erswebzone.com/articles/135591-free-agency-jimmy-garoppolo-despite-49ers-offensive-losses/","urlToImage":"https://www.49erswebzone.com/v/ri4uZI/content/media/cache/article-1400x0-834697c7158657faa68774429ec68e93.jpg","publishedAt":"2020-03-23T04:35:04Z","content":"The San Francisco 49ers didn't make any quarterback moves this past week — the start of free agency. The team lost wide receiver Emmanuel Sanders to the New Orleans Saints and parted ways with starting guard Mike Person. Yet, it was still a pretty good week f… [+2220 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"","title":"Coronavirus: Jazz center Rudy Gobert says he lost his sense of smell due to COVID-19 - CBS Sports","description":"Gobert was the first NBA player to test positive for the coronavirus","url":"https://www.cbssports.com/nba/news/coronavirus-jazz-center-rudy-gobert-says-he-lost-his-sense-of-smell-due-to-covid-19/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/22/23a1943b-f9f7-4457-8ddc-d4bb1483f351/thumbnail/1200x675/2cc3e51b5853f667eada5cf032b1991b/gobert.jpg","publishedAt":"2020-03-23T04:12:00Z","content":"Nearly two weeks ago, Utah Jazz center Rudy Gobert tested positive for the coronavirus, which set off a chain of events unlike anything we've ever seen in the NBA. The Jazz-Oklahoma City Thunder game was called off, and a short while later the league suspende… [+2234 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Megan Armstrong","title":"Bears Rumors: Ex-1st-Round Pick Barkevious Mingo Agrees to 1-Year Contract - Bleacher Report","description":"The  Chicago Bears  are signing free-agent linebacker  Barkevious Mingo  on a one-year deal, according to NFL Network's  Ian Rapoport  on Sunday night.   Aaron Wilson  of the  Houston Chronicle  reported Mingo's deal will be worth $1...","url":"https://bleacherreport.com/articles/2882521-bears-rumors-ex-1st-round-pick-barkevious-mingo-agrees-to-1-year-contract","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/859/068/hi-res-be34992329da655057a8c7f03de8c4ef_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2020-03-23T03:18:26Z","content":"Michael Hickey/Getty Images\r\nThe Chicago Bears are signing free-agent linebacker Barkevious Mingo on a one-year deal, according to NFL Network's Ian Rapoport on Sunday night.\r\nAaron Wilson of the Houston Chronicle reported Mingo's deal will be worth $1.187 mi… [+1864 chars]"},{"source":{"id":null,"name":"Nypost.com"},"author":"Mark Cannizzaro","title":"Dolphins must do everything to pick Tua Tagovailoa in NFL draft - New York Post ","description":"In exactly a month, the 2020 NFL Draft will commence, with league commissioner Roger Goodell announcing which team LSU quarterback Joe Burrow goes to as the No. 1 overall pick — whether that’s to t…","url":"https://nypost.com/2020/03/22/dolphins-must-do-everything-to-pick-tua-tagovailoa-in-nfl-draft/","urlToImage":"https://thenypost.files.wordpress.com/2020/03/tua-tagovailoa-1.jpg?quality=90&strip=all&w=1200","publishedAt":"2020-03-23T03:04:28Z","content":"In exactly a month, the 2020 NFL Draft will commence, with league commissioner Roger Goodell announcing which team LSU quarterback Joe Burrow goes to as the No. 1 overall pick whether thats to the team currently on the clock, the Bengals, or one that trades u… [+4427 chars]"},{"source":{"id":null,"name":"Nesn.com"},"author":"https://nesn.com/sean-t-mcguire/","title":"McCourty Twins Confident In Patriots’ Quarterback Situation After Tom Brady’s Exit - NESN","description":"The McCourty brothers -- Devin and Jason -- are well-versed with the business side of the NFL. It's how they…","url":"https://nesn.com/2020/03/mccourty-twins-confident-in-patriots-quarterback-situation-after-tom-bradys-exit/","urlToImage":"https://nesn.com/wp-content/uploads/2020/03/mccourtys.jpg","publishedAt":"2020-03-23T02:54:31Z","content":"The McCourty brothers — Devin and Jason — are well-versed with the business side of the NFL.\r\nIt’s how they qualified the many comings and going this offseason for the New England Patriots, specifically with quarterback Tom Brady leaving to organization for t… [+2086 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":"Todd Archer","title":"Source -- Cowboys DE Randy Gregory files for reinstatement - ESPN","description":"Randy Gregory was suspended indefinitely last February for recurring issues involving the substance-abuse policy.","url":"https://www.espn.com/nfl/story/_/id/28940406/source-cowboys-de-randy-gregory-files-reinstatement","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0901%2Fr424605_1296x729_16%2D9.jpg","publishedAt":"2020-03-23T02:40:46Z","content":"FRISCO, Texas -- Dallas Cowboys defensive end Randy Gregory, suspended indefinitely in February 2019, has officially filed for reinstatement to the NFL, a source told ESPN.\r\nUnder the league's substance-abuse policy, the NFL has to make a decision on Gregory'… [+2084 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Ben Pickman","title":"NFL Rumors: Brady's One Request, Pats Bring Back QB Brian Hoyer - Sports Illustrated","description":"Keep up with the latest news and rumors around the NFL.","url":"https://www.si.com/nfl/2020/03/23/nfl-rumors-brady-hoyer-patriots","urlToImage":"https://www.si.com/.image/t_share/MTcxMzI3OTI1MzA2NTMzNTU1/usatsi_13652059.jpg","publishedAt":"2020-03-23T02:38:00Z","content":"The New England Patriots reached an agreement to bring back quarterback Brian Hoyer on Sunday, according to the MMQB's Albert Breer.\r\nThis marks Hoyer's third stint with the Patriots. He started his career there in 2009 and played in 13 games over three seaso… [+1763 chars]"},{"source":{"id":null,"name":"Silive.com"},"author":"Andrew Kahn | akahn1@mlive.com","title":"Three 1 seeds lose in NCAA Tournament second-round simulation - SILive.com","description":"The first-round simulation was bland. The second was bonkers.","url":"https://www.silive.com/sports/2020/03/three-1-seeds-lose-in-ncaa-tournament-second-round-simulation.html","urlToImage":"https://www.silive.com/resizer/uynDal-kH-Hl9FDMi14KkPNjJkc=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/7K7KBMDSWZGOJO3QYU55WNNXHI.jpg","publishedAt":"2020-03-23T01:19:00Z","content":"Our simulations for the first round of the NCAA Tournament that isnt happening were somewhat bland: not many upsets, a lot of blowouts.\r\nWe simulated the second round too and, well, it totally redeemed itself.\r\nThree No. 1 seeds went down, and the fourth bare… [+3106 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"Mike Brehm","title":"Fox Sports announcer Joe Buck offers to call people's personal videos - USA TODAY","description":"Joe Buck wants to get \"some practice reps in,\" with sports postponed due to coronavirus. \"Send me videos of what you’re doing at home,\" he asks.","url":"https://www.usatoday.com/story/sports/media/2020/03/22/joe-buck-fox-sports-broadcaster-offers-play-by-play-videos/2896357001/","urlToImage":"https://www.gannett-cdn.com/presto/2020/03/23/USAT/f4fbce39-fd10-415a-b624-f14ffef5dc98-joe_buck.JPG?crop=4041,2274,x0,y203&width=3200&height=1680&fit=bounds","publishedAt":"2020-03-23T00:35:19Z","content":"SportsPulse: Sports plays a vital role in our day-to-day lives as a means to escape. Mental health expert Eric Kussin says it's OK to feel depressed over the loss of sports in the wake of the coronavirus outbreak and provides steps you can take to address the… [+1644 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":"https://twitter.com/Ali_Thanawalla","title":"What rookie Paschall has learned from Warriors veterans - NBCSports.com","description":"Eric Paschall is soaking up everything the Warriors' championship core is teaching him.","url":"https://www.nbcsports.com/bayarea/warriors/what-eric-paschall-has-learned-warriors-veterans-rookie-season","urlToImage":"https://www.nbcsports.com/bayarea/sites/csnbayarea/files/2020/03/22/ericpaschalldraymondtalkingap.jpg","publishedAt":"2020-03-23T00:07:23Z","content":"Wins by the Warriors have been hard to come by this season.\r\nBut there was a time, not too long ago, when the Warriors couldn't lose.\r\nFour and a half years ago, the Warriors were unbeatable for nearly two months.\r\nComing off their first NBA title in 40 years… [+1278 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"Norwich City v. Liverpool | PREMIER LEAGUE CLASSIC MATCH | 1/23/16 | NBC Sports - NBC Sports","description":"Relive a modern-day Premier League classic, when Adam Lallana's stoppage-time winner lifted Liverpool over Norwich City on a crazy day at Carrow Road. #NBCSp...","url":"https://www.youtube.com/watch?v=2_cuUbWOXSI","urlToImage":"https://i.ytimg.com/vi/2_cuUbWOXSI/maxresdefault.jpg","publishedAt":"2020-03-23T00:00:00Z","content":"Sign in to report inappropriate content.\r\nSign in"},{"source":{"id":null,"name":"Mynorthwest.com"},"author":"","title":"Seahawks Takeaways: Focus stays on OL, not defense, with reported addition of Chance Warmack - MyNorthwest.com","description":"The Seahawks have reportedly made five additions since free agency started on March 18, but all but one have been offensive linemen.","url":"https://sports.mynorthwest.com/835372/seahawks-takeaways-chance-warmack-addition/?","urlToImage":"https://sports.mynorthwest.com/wp-content/uploads/2020/03/chance-warmack-getty-2-620.jpg","publishedAt":"2020-03-22T23:16:11Z","content":"That the Seahawks havent a splashy move yet in free agency shouldnt surprise fans  Seattle rarely makes blockbuster trades or signings this time of the year. But theres one aspect of Seattles free agency that has raised a few eyebrows.\r\nDave Wyman: Why luck a… [+3565 chars]"},{"source":{"id":null,"name":"Clutchpoints.com"},"author":"Marty Fenn","title":"Seahawks rumors: Seattle’s offer to Jadeveon Clowney has been revealed - ClutchPoints","description":"The Seattle Seahawks are still hoping to re-sign free-agent defensive end, Jadeveon Clowney, though their offer appears to be below his demands in terms of annual average value (AAV). Seattle have reportedly offered Clowney a contract at an estimate of $18 mi…","url":"https://clutchpoints.com/seahawks-rumors-seattles-offer-to-jadeveon-clowney-has-been-revealed/","urlToImage":"https://clutchpoints.com/wp-content/uploads/2020/03/Jadeveon-Clowney-1000x600.jpg","publishedAt":"2020-03-22T23:03:58Z","content":"The Seattle Seahawks are still hoping to re-sign free-agent defensive end, Jadeveon Clowney, though their offer appears to be below his demands in terms of annual average value (AAV).\r\nSeattle have reportedly offered Clowney a contract at an estimate of $18 m… [+1433 chars]"},{"source":{"id":null,"name":"Inquirer.com"},"author":"Frank Fitzpatrick","title":"Golf groups ask Gov. Wolf to reopen Pennsylvania’s courses that were shut down due to pandemic - The Philadelphia Inquirer","description":"Groups that represent the state’s nearly 700 courses, its golf professionals, managers, and superintendents, asked Wolf to reconsider his order closing all businesses that aren’t life-sustaining.","url":"https://www.inquirer.com/health/coronavirus/golf-coronavirus-pennsylvania-courses-gov-wolf-20200322.html","urlToImage":"https://www.inquirer.com/resizer/Uo3uqhdfrXnH1Wmg5a5ipEsY6bU=/1200x0/center/middle/www.inquirer.com/resizer/j5APsdK7qhztJJp1hmFGcWHQr8g=/1200x0/center/middle/arc-anglerfish-arc2-prod-pmn.s3.amazonaws.com/public/4N73N22CK5FKXCTUP7ASICAZ4Y.jpg","publishedAt":"2020-03-22T22:41:33Z","content":"A broad coalition of golfing organizations from across Pennsylvania has petitioned Gov. Wolf to allow their courses, shut down during the coronavirus pandemic, to reopen.\r\nIn a letter dated Friday, 10 groups that represent the states nearly 700 courses, its g… [+1299 chars]"},{"source":{"id":"nfl-news","name":"NFL News"},"author":"Adam Maya","title":"Rivers considered retirement before FA - NFL.com","description":"Philip Rivers, a free agent for the first time in his career, had been projected for weeks to end up with the Colts. Before that opportunity came, the former Chargers QB said he was pondering retirement.","url":"http://www.nfl.com/news/story/0ap3000001107271/article/philip-rivers-considered-retirement-before-free-agency","urlToImage":"http://static.nfl.com/static/content/public/photo/2020/03/22/0ap3000001107270_thumbnail_200_150.jpg","publishedAt":"2020-03-22T22:38:00Z","content":"Philip Rivers had been publicly linked to the Indianapolis Colts for weeks. The conversation began before the Chargers announced in early February their longtime franchise quarterback would be entering free agency.\r\nBy then, the Colts, whose head coach and of… [+2546 chars]"},{"source":{"id":null,"name":"Nypost.com"},"author":"Brett Cyrgalis","title":"Forgotten Stanley Cup mayhem resurfaces with coronavirus - New York Post ","description":"Sarah Hall has heard the stories about her great-grandfather, more and more as the years have gone on. She understands the rising interest in Joe Hall — sometimes dubbed “Bad” Joe Hall for his over…","url":"https://nypost.com/2020/03/22/forgotten-stanley-cup-mayhem-resurfaces-with-coronavirus/","urlToImage":"https://thenypost.files.wordpress.com/2020/03/stanley-cup-logo.jpg?quality=90&strip=all&w=1200","publishedAt":"2020-03-22T22:33:46Z","content":"Sarah Hall has heard the stories about her great-grandfather, more and more as the years have gone on. She understands the rising interest in Joe Hall sometimes dubbed Bad Joe Hall for his overwhelming penalty minutes while playing for the Canadiens just afte… [+4794 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"","title":"NBA free agency rumors: Brandon Ingram expected to remain with Pelicans, who will reportedly match any offer - CBS Sports","description":"The first-time All-Star may technically be a free agent in the offseason, but the Pels apparently won't let him go anywhere","url":"https://www.cbssports.com/nba/news/nba-free-agency-rumors-brandon-ingram-expected-to-remain-with-pelicans-who-will-reportedly-match-any-offer/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2020/01/09/7fbdef7b-b17e-4405-b61b-6e6fb03ca14d/thumbnail/1200x675/467fa896e5df54862d04c0b4662c184e/ingram-shot.jpg","publishedAt":"2020-03-22T22:14:14Z","content":"Brandon Ingram may technically be bound for free agency this offseason, but don't count on the New Orleans Pelicans letting him get away. As a former first-round pick playing out the end of a rookie contract, Ingram will be a restricted free agent this summer… [+2919 chars]"},{"source":{"id":null,"name":"Nytimes.com"},"author":"Raphael Minder","title":"Lorenzo Sanz, Who Led Comeback of Real Madrid, Dies at 76 - The New York Times","description":"He helped the soccer club win its first European Cup in 32 years. He  is also the most prominent Spaniard to die of the coronavirus.","url":"https://www.nytimes.com/2020/03/22/obituaries/lorenzo-sanz-dead.html","urlToImage":"https://static01.nyt.com/images/2020/03/22/us/22sanz-image1/merlin_170817072_d49caca7-d031-4e0b-90ff-6c1388635f33-facebookJumbo.jpg","publishedAt":"2020-03-22T22:12:54Z","content":"After the team won the Champions League in 2000, Mr. Sanz decided to hold an early election, but the move backfired.He was defeated by Mr. Pérez by just over 3,000 votes among the clubs 100,000 members, who pay an annual fee and hold the right to elect the cl… [+1323 chars]"}]}